{"id":1662,"date":"2010-07-11T20:40:48","date_gmt":"2010-07-12T01:40:48","guid":{"rendered":"http:\/\/www.bupkis.org\/index.php"},"modified":"2018-01-04T09:55:39","modified_gmt":"2018-01-04T14:55:39","slug":"french-onion-soup-gratinee","status":"publish","type":"page","link":"https:\/\/www.bupkis.org\/index.php\/recipes-2\/soups-2\/french-onion-soup-gratinee","title":{"rendered":"French Onion Soup Gratinée (Baked French Onion Soup)"},"content":{"rendered":"<p>This is the best French Onion Soup Gratinée I&#8217;ve ever had, including some from very expensive restaurants.<\/p>\n<p>The &#8220;trick&#8221; is that French Onion Soup Gratinée is <em>supposed<\/em> to be <strong>onion<\/strong> soup. Not canned beef broth with some onions, soggy bread and cheap cheese. This recipe extracts nearly every possible flavor variation from the onions, via multiple deglazings and several different levels of cooking.<\/p>\n<p>The first batch of onion gets caramelized until there&#8217;s almost nothing left but wonderful fond. The second batch of onions gets cooked until mostly caramelized and very soft, the third even less and the fourth is left with a distinct &#8220;onion&#8221; flavor.<\/p>\n<p>It has a beautifully deep, rich flavor with layers of onion taste profiles ranging from deep, dark and sweet, to bright and slightly sharp with a little bite. The sherry provides a touch of brightness and the thyme and bay leaf provide a nice &#8220;green&#8221; note.<\/p>\n<p>The soup&#8217;s deep, rich flavor comes from <a href=\"http:\/\/en.wikipedia.org\/wiki\/Caramelization\">caramelization<\/a> of the onions. Traditionally, this is done just once when sautéing the onions, however there&#8217;s no reason to stop there. The onions are still packed with potential flavor, and we&#8217;re going to get all of it!<\/p>\n<p>This recipe calls for sauteing a batch of onions until they&#8217;re nearly gone, then deglazing the pan with a little water. Then we do it again. And again, creating a deep, rich onion broth with huge flavor. The last batch of onions doesn&#8217;t get cooked quite as much, which creates an additional layer of flavor (a little sharp with a distinct onion flavor), which contrasts nicely with the rich, slightly sweet flavor in the broth.<\/p>\n<p>The garlic toast adds a nice garlicky bite, the aroma of the olive oil and a wonderful crunchy texture, the herbs and sherry brighten it up, and selecting the right cheese makes everything just about perfect.<\/p>\n<table border=\"0\" cellspacing=\"2\" cellpadding=\"2\">\n<tbody>\n<tr>\n<td colspan=\"3\"><strong>Ingredients<\/strong>:<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">5<\/td>\n<td>Lbs<\/td>\n<td>Yellow Onions, peeled, cut pole-to-pole, then 1\/4 inch thick<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">4<\/td>\n<td>Tablespoons<\/td>\n<td>Unsalted Butter, cut into chunks<\/td>\n<\/tr>\n<tr>\n<td align=\"right\"><\/td>\n<td><\/td>\n<td>Water<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">4<\/td>\n<td>Cups<\/td>\n<td>Low Sodium Chicken Broth<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">2<\/td>\n<td>Cups<\/td>\n<td>Beef Broth<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">1\/2<\/td>\n<td>C<\/td>\n<td><em>Dry<\/em> Sherry. (<strong><em>not<\/em> &#8220;Cooking Sherry&#8221;) <\/strong>This should be good enough to drink. Don&#8217;t be cheap here.<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">3<\/td>\n<td>Sprigs<\/td>\n<td>Fresh Thyme<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">1<\/td>\n<td><\/td>\n<td>Bay Leaf<\/td>\n<\/tr>\n<tr>\n<td align=\"right\"><\/td>\n<td><\/td>\n<td>Kosher Salt and Fresh Ground Pepper<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">1<\/td>\n<td>Lb<\/td>\n<td><em>Real<\/em> Gruyere Cheese, aged 10-12 months. Taste this before you buy it. It should be a little earthy but not overpowering.<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">1<\/td>\n<td><\/td>\n<td>Baguette, with 12 slices one half an inch thick cut from it<\/td>\n<\/tr>\n<tr>\n<td align=\"right\"><\/td>\n<td><\/td>\n<td>Olive Oil<\/td>\n<\/tr>\n<tr>\n<td align=\"right\">3<\/td>\n<td>Cloves<\/td>\n<td>Garlic<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><strong>Cooking:<\/strong><\/p>\n<ul>\n<li>Grate the cheese and place in the refrigerator.<\/li>\n<li>Heat a large thick-bottomed pot on medium high, add a chunk of butter and about a quarter of the onions. Sprinkle on a pinch salt and saute until completely caramelized and very dark brown. When the bottom of the pot is covered with fond, deglaze with a little water.  Repeat until the onions are almost gone and there is a ton of rich, dark, brown fond in the bottom of the pot. Stir as necessary, and adjust the heat to prevent burning.<\/li>\n<li>Add another chunk of butter, another quarter of the onions and repeat the above process, but don&#8217;t cook quite as dark.<\/li>\n<li>Repeat for all four batches of onions. On the last batch, cook until the onions are softened, but not completely wilted, and deglaze with sherry.<\/li>\n<li>Add all the other ingredients except the salt and pepper and simmer for 30 minutes.<\/li>\n<li>Remove the bay leaf and the thyme. Taste it. Add salt and pepper or sherry if needed.<\/li>\n<li>At this point, the soup can be refrigerated for up to several days if you wish. I typically store it in a vacuum sealer bag to prevent it from picking up flavors from the refrigerator.<\/li>\n<\/ul>\n<p><strong>Serving:<\/strong><\/p>\n<ul>\n<li>If chilled, reheat the soup, <em>but don&#8217;t boil!<\/em>.<\/li>\n<li>Preheat your broiler on high.<\/li>\n<li>Taste it and see if it needs a <strong>little<\/strong> more salt, pepper or sherry. Or not.<\/li>\n<li>Take all 12 slices of baguette, trim to fit the crocks, then place the bread on a tray and broil until golden brown, then turn over do the same to the other side.<\/li>\n<li>Brush the side you cooked last (the hot side) of each slice with olive oil then rub a garlic clove into it. You can usually get 4 slices from each clove of garlic.<\/li>\n<li>Ladle the soup into oven-proof crocks, leaving about a 1\/2 inch of space on the top.<\/li>\n<li>Lay the garlic toast over the soup, garlic and olive oil side <em>down <\/em>(the oiled side keeps the crouton crunchy longer), cover with grated cheese and broil until the cheese is browned to about the same level as a good pizza.<\/li>\n<li>Serve immediately with the remaining baguette and butter on the side.<\/li>\n<\/ul>\n<p>Serves 6<\/p>\n<p>This will make your guests insanely jealous, since it&#8217;s very unlikely they have ever had French Onion Soup this good anywhere, ever.<\/p>\n<p>It&#8217;s also great for impressing a date. If you serve this with a small salad of fresh baby greens, crumbled blue cheese,  balsamic vinegar and extra virgin olive oil, a perfectly cooked filet mignon and <a href=\"https:\/\/www.bupkis.org\/index.php\/recipes-2\/side-dishes\/couscous-pine-nuts\">couscous with pine nuts<\/a>, you had better be ready to get married. 😎<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is the best French Onion Soup Gratinée I&#8217;ve ever had, including some from very expensive restaurants. The &#8220;trick&#8221; is that French Onion Soup Gratinée is supposed to be onion soup. Not canned beef broth with some onions, soggy bread and cheap cheese. This recipe extracts nearly every possible flavor variation from the onions, via &#8230; <a title=\"French Onion Soup Gratinée (Baked French Onion Soup)\" class=\"read-more\" href=\"https:\/\/www.bupkis.org\/index.php\/recipes-2\/soups-2\/french-onion-soup-gratinee\" aria-label=\"Read more about French Onion Soup Gratinée (Baked French Onion Soup)\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":3375,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-1662","page","type-page","status-publish"],"_links":{"self":[{"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/pages\/1662","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/comments?post=1662"}],"version-history":[{"count":58,"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/pages\/1662\/revisions"}],"predecessor-version":[{"id":1666,"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/pages\/1662\/revisions\/1666"}],"up":[{"embeddable":true,"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/pages\/3375"}],"wp:attachment":[{"href":"https:\/\/www.bupkis.org\/index.php\/wp-json\/wp\/v2\/media?parent=1662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}